Revit 2024 API
Wave.WaveAmplitude Property
 The property labeled "Amplitude" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WaveAmplitude { get; }
Visual Basic
Public Shared ReadOnly Property WaveAmplitude As String
	Get
Visual C++
public:
static property String^ WaveAmplitude {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 10000".
See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace